#Вопрос 1-2: Еженедельно работнику выплачивается сдельное денежное вознаграждение, 
#            которое бывает то больше, то меньше в зависимости от объёма выполненной работы. 

# Данные выплат, руб.:
disbursement <- c(6160.92, 6928.08, 7235.88, 6728.52, 7457.63, 6767.08, 7195.33, 7046.22, 7397.48, 6831.44, 6431.11, 7155.65, 7326.69, 6764.33, 7428.89, 7464.09, 6789.03, 7034.01, 7395.15, 6560.25, 7260.67, 7111.07, 6805.27, 7468.98, 7566.07, 7323.04, 6550.49, 6614, 6824.95, 6767.61, 6541.17, 7384.53, 6749.99, 7138.25, 6322.93, 6997.15, 7093.14, 7011.49, 6922.28, 6694.82, 7529.42, 6774.83, 6604.95, 7332.19, 7098.18, 7430.66, 6614.21, 6827.23, 6607.77, 7799.95, 7864.04, 7793.23, 6892.41, 6616.64, 6738.12, 7060.66, 7517.08, 6334.34, 6757.52, 7158.62, 6230.6, 7561.88, 6694.78, 7007.61, 7200.02, 8043.48, 6501.98, 6933.69, 7073.32, 6940.64, 7858.29, 7017.87, 6856.9, 6621.29, 7152.3, 6573.43, 6643, 7098.14, 7485.06, 7761.08, 6808.46, 6991.78, 6882.79, 6773.1, 7326.49, 7052.77, 6678.67, 7258.86, 7038.82, 6649.69, 6606.03, 6390.03, 7060.11, 7564.56, 7143.89, 6303.34, 6581.86, 6573.22, 6861.2, 7244.95)

#Частота третьего разряда: 
boundary <-seq(6100,8100, by=200)
disbursement.grouped <- cut(sort(disbursement),breaks = boundary, right = FALSE)
table(disbursement.grouped)[3]

#Среднее арифметическое μ:
mean(disbursement)

#Медиана (второй квартиль Q2):
median(disbursement)

#Сводная статистика:
summary(disbursement)

#График: 
hist(disbursement,
     breaks = boundary,    # число разрядов
     xlim = c(6000, 8200), # диапазон оси x 
     ylim = c(0, 20),      # диапазон оси y
     col = "gold",         # цвет столбиков
     
     main = "Распределние денежного вознаграждения работника",
     xlab = "сумма выплат, руб",
     ylab = "n выплат")

#Нанесение среднего арифметического (μ) на график:
abline(v=mean(disbursement), col = 'red')
text(x = mean(disbursement), y = max(table(disbursement.grouped))-1, 'среднее', col = 'red')

#Нанесение медианы (второй квантиль Q2) на график:
abline(v=median(disbursement), col = 'blue')
text(x = median(disbursement), y = max(table(disbursement.grouped))-3, 'медиана', col = 'blue')

