# Вопрос 4: В опубликованных результатах социологического опроса 1400 респондентов указано,
#           статистическая погрешность составляет 3.3%.

cat("\n")
n <- 1400
cat("\n")
MOE <- 3.3
cat("\n")


# Укажите с точностью до десятых процента, 
# какой для данной погрешности был принят уровень доверия CL:

MOE <- MOE/100
p <- 0.5
SEp1 <- sqrt((p*(1-p))/n)
a <-0
b <-0
c <-0
i<-999
for (i in 999:1){
  CL <- MOE/(0 - qnorm(0.5*(1-(i/1000)))) 
  #cat("i=", i/1000, "  CL=", CL, "\n")
  a[1000-i] <- i/1000
  b[1000-i] <- CL
  c[1000-i] <- abs(CL-SEp1)
  i <- i - 1
  d <- data.frame(a,b,c)
}
print(paste0("Ответ: ", d[[1]][d[[3]]==min(d[[3]])]*100, "%"))

plot(d$a,d$c,
     xlab = "CL",
     ylab = "abs(CL-SEp1)")
