# Вопрос 3-5: Получены данные голосования за трёх кандидатов на должность декана (кандидаты : А.С. Кузнецов, М.И. Петрова и Н.Ф. Федоров обозначены инициалами ФИО):
dekan <-c("ПМИ", "ПМИ", "КАС", "ПМИ", "КАС", "ПМИ", "ПМИ", "КАС", "КАС", "КАС", "КАС", "КАС", "КАС", "ПМИ", "КАС", "ПМИ", "ПМИ", "КАС", "ПМИ", "КАС", "КАС", "ПМИ", "ПМИ", "ПМИ", "ПМИ", "ПМИ", "КАС", "ПМИ", "КАС", "КАС", "КАС", "КАС", "ПМИ", "ПМИ", "ПМИ", "ПМИ", "ПМИ", "ПМИ", "КАС", "КАС", "КАС", "ПМИ", "КАС", "КАС", "ПМИ", "КАС", "КАС", "КАС", "КАС", "КАС", "КАС")

# Определите:

  # Объем наблюдений: 
  length(dekan)

  # Абсолютные частоты: 
  table(dekan)[c("ПМИ","КАС","ФНФ")]

  # Относительные частоты: 
  table(dekan)/length(dekan)

# Постройте по данным предыдущего вопроса о выборах декана диаграмму распределения частот с указанием полных фамилий кандидатов.
  
  #График: 
  barplot(table(dekan)[c("КАС","ПМИ","ФНФ")], 
          names.arg= c("А.С. Кузнецов", "М.И. Петрова", "Н.Ф. Федоров"),
          main=  "Распределение голосов за кандидатов", 
          xlab = "кандидат",
          ylab = "голоса за кандидата (кол-во)",
          ylim = c(0, 30))
        

