a<- c("ПМИ", "ПМИ", "КАС", "КАС", "ПМИ", "КАС", "КАС", "КАС", "КАС", "КАС", "ПМИ", "КАС", "КАС", "КАС", "КАС", "ПМИ", "ПМИ", "КАС", "КАС", "ПМИ", "ПМИ", "ПМИ", "ПМИ", "ПМИ", "ПМИ", "ПМИ", "ПМИ", "КАС", "ПМИ", "ПМИ", "ПМИ", "ПМИ", "ПМИ", "КАС", "КАС", "ПМИ", "КАС", "ПМИ", "КАС", "КАС", "ПМИ", "КАС", "ПМИ", "КАС", "КАС", "КАС", "ПМИ", "КАС", "ПМИ", "ПМИ", "КАС", "ПМИ", "КАС", "КАС", "КАС", "ПМИ", "ПМИ", "ПМИ", "КАС", "КАС", "КАС")

#объём наблюдений:
length(a)

#абсолютную частоту голосов за П.М.И.:
table(a)["ПМИ"]

#относительную частоту голосов за К.А.С.:
table(a)/length(a)

b<-table(a) 
# Добавил в таблицу 3 переменную:
b["ФНФ"]<-(b["ФНФ"]=0)
b
# Теперь переименовал названия
names(b) <-c("А.С. Кузнецов", "М.И. Петрова", "Н.Ф. Федоров")
b

# График:  
barplot(as.numeric(b), #вернул просто вектор чисел, мож отдельно проверить
        names.arg = names(b),
        col = "steelblue",
        main="Распределение голосов", 
        xlab = "Голоса (кол-во) ",  
        ylab = "Кандидаты (кол-во)",
        border = "red",
        ylim = c(0, 35))